/***************************************************************************//**
 * @file
 * @brief USB Host Pipe-Based Host Controller Driver (Pbhcd)
 *        Synopsys Designware Core USB 2.0 Otg (FS)
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                       DEPENDENCIES & AVAIL CHECK(S)
 ********************************************************************************************************
 *******************************************************************************************************/

#include  <rtos_description.h>

#if (defined(RTOS_MODULE_USB_HOST_AVAIL))


//                                                                 --------- HOST PORT CONTROL AND STATUS REG ---------
#define  DWCOTGFS_HPRT_PORT_CONN_STS                DEF_BIT_00  // Port connect status.
#define  DWCOTGFS_HPRT_PORT_CONN_DET                DEF_BIT_01  // Port connect detected.
#define  DWCOTGFS_HPRT_PORT_EN                      DEF_BIT_02  // Port enable.
#define  DWCOTGFS_HPRT_PORT_EN_CHNG                 DEF_BIT_03  // Port enable/disable change.
#define  DWCOTGFS_HPRT_PORT_OC                      DEF_BIT_04  // Port overcurrent active.
#define  DWCOTGFS_HPRT_PORT_OCCHNG                  DEF_BIT_05  // Port overcurrent change.
#define  DWCOTGFS_HPRT_PORT_RES                     DEF_BIT_06  // Port resume.
#define  DWCOTGFS_HPRT_PORT_SUSP                    DEF_BIT_07  // Port suspend.
#define  DWCOTGFS_HPRT_PORT_RST                     DEF_BIT_08  // Port reset.
#define  DWCOTGFS_HPRT_PORT_PWR                     DEF_BIT_12  // Port power.
#define  DWCOTGFS_HPRT_PORT_SPEED                   DEF_BIT_FIELD(2u, 17u)
#define  DWCOTGFS_HPRT_PORT_SPD_FS                  1u
#define  DWCOTGFS_HPRT_PORT_SPD_LS                  2u
#define  DWCOTGFS_HPRT_PORT_SPD_NO_SPEED            3u
//                                                                 Macro to avoid clearing some bits generating int.
#define  DWCOTGFS_HPRT_BITS_CLR_PRESERVE(reg)       {  \
    DEF_BIT_CLR((reg), (DWCOTGFS_HPRT_PORT_EN          \
                        | DWCOTGFS_HPRT_PORT_CONN_DET  \
                        | DWCOTGFS_HPRT_PORT_EN_CHNG   \
                        | DWCOTGFS_HPRT_PORT_OCCHNG)); \
}

#define  DWCOTGFS_PCGCCTL_BIT_RSTPDWNMODULE         DEF_BIT_03
#define  DWCOTGFS_PCGCCTL_BIT_PWRCLMP               DEF_BIT_02
#define  DWCOTGFS_PCGCCTL_BIT_GATEHCLK              DEF_BIT_01
#define  DWCOTGFS_PCGCCTL_BIT_STPPCLK               DEF_BIT_00

/********************************************************************************************************
 *                           BIT/REG DEFINES FOR GIANT GECKO SERIES 1 ERRATA
 *******************************************************************************************************/

#if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_100)
#define  USB_REG_DATTRIM1             *(CPU_REG32 *)(USB_BASE + 0x34u)
#define  DATTRIM1_BIT_ENDLYPULLUP      DEF_BIT_07
#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                           DRIVER DATA TYPES
 *******************************************************************************************************/

typedef struct usbh_dwcotgfs_host_ch_reg {                      // ------------- HOST CHANNEL-X DATA TYPE -------------
  CPU_REG32 HCCHARx;                                            // Host channel-x characteristics
  CPU_REG32 HCSPLTx;                                            // Host channel-x split control
  CPU_REG32 HCINTx;                                             // Host channel-x interrupt
  CPU_REG32 HCINTMSKx;                                          // Host channel-x interrupt mask
  CPU_REG32 HCTSIZx;                                            // Host channel-x transfer size
  CPU_REG32 HCDMAx;                                             // Host channel-x DMA address
  CPU_REG32 RSVD1[2u];
} USBH_DWCOTGFS_HOST_CH_REG;

typedef struct usbh_dwcotgfs_dfifo_reg {                        // ---------- DATA FIFO ACCESS DATA TYPE --------------
  CPU_REG32 DATA[DWCOTGFS_DFIFO_SIZE];                          // 4K bytes for ALL channels.
} USBH_DWCOTGFS_DFIFO_REG;

typedef struct usbh_dwcotgfs_reg {
  //                                                               ----- CORE GLOBAL CONTROL AND STATUS REGISTERS -----
  CPU_REG32                 GOTGCTL;                            // 0x0000 Core control and status
  CPU_REG32                 GOTGINT;                            // 0x0004 Core interrupt
  CPU_REG32                 GAHBCFG;                            // 0x0008 Core AHB configuration
  CPU_REG32                 GUSBCFG;                            // 0x000C Core USB configuration
  CPU_REG32                 GRSTCTL;                            // 0x0010 Core reset
  CPU_REG32                 GINTSTS;                            // 0x0014 Core interrupt
  CPU_REG32                 GINTMSK;                            // 0x0018 Core interrupt mask
  CPU_REG32                 GRXSTSR;                            // 0x001C Core receive status debug read
  CPU_REG32                 GRXSTSP;                            // 0x0020 Core status read and pop
  CPU_REG32                 GRXFSIZ;                            // 0x0024 Core receive FIFO size
  CPU_REG32                 HNPTXFSIZ;                          // 0x0028 Host non-periodic transmit FIFO size
  CPU_REG32                 HNPTXSTS;                           // 0x002C Core Non Periodic Tx FIFO/Queue status
  CPU_REG32                 RSVD0[2u];
  CPU_REG32                 GCCFG;                              // 0x0038 General core configuration
  CPU_REG32                 CID;                                // 0x003C Core ID register
  CPU_REG32                 RSVD1[48u];
  CPU_REG32                 HPTXFSIZ;                           // 0x0100 Core Host Periodic Tx FIFO size
  CPU_REG32                 RSVD2[191u];
  //                                                               ------ HOST MODE CONTROL AND STATUS REGISTERS ------
  CPU_REG32                 HCFG;                               // 0x0400 Host configuration
  CPU_REG32                 HFIR;                               // 0x0404 Host frame interval
  CPU_REG32                 HFNUM;                              // 0x0408 Host frame number/frame time remaining
  CPU_REG32                 RSVD3;
  CPU_REG32                 HPTXSTS;                            // 0x0410 Host periodic transmit FIFO/queue status
  CPU_REG32                 HAINT;                              // 0x0414 Host all channels interrupt
  CPU_REG32                 HAINTMSK;                           // 0x0418 Host all channels interrupt mask
  CPU_REG32                 RSVD4[9u];
  CPU_REG32                 HPRT;                               // 0x0440 Host port control and status
  CPU_REG32                 RSVD5[47u];
  USBH_DWCOTGFS_HOST_CH_REG HCH[16u];                           // 0x0500 Host Channel-x regiters
  CPU_REG32                 RSVD6[448u];
  //                                                               -- POWER & CLOCK GATING CONTROL & STATUS REGISTER --
  CPU_REG32                 PCGCR;                              // 0x0E00 Power anc clock gating control
  CPU_REG32                 RSVD7[127u];
  //                                                               --- DATA FIFO (DFIFO) HOST-CH X ACCESS REGISTERS ---
  USBH_DWCOTGFS_DFIFO_REG   DFIFO[OTGFS_MAX_NBR_HOST_CH];       // 0x1000 Data FIFO host channel-x access registers
} USBH_DWCOTGFS_REG;

typedef struct usbh_dwcotgfs_ch_info {
  CPU_INT08U  CurXferErrCnt;                                    // For IN and OUT xfer when Transaction Error int.
  CPU_INT08U  HaltSrc;                                          // Indicates source of the halt interrupt.
  CPU_BOOLEAN Halting;                                          // Flag indicating channel halt in progress.
  CPU_BOOLEAN Aborted;                                          // Flag indicating channel has been aborted.
  CPU_BOOLEAN RestartComm;                                      // Flag indicating to restart comm on an unwanted...
                                                                // ...aborted pipe.

  CPU_INT32U  RxXferLen;                                        // Nbr of bytes received in Rx FIFO.
