/*
 * Copyright (c) 2005-2016, GreenPeak Technologies
 * Copyright (c) 2017, Qorvo Inc
 *
 * global.h
 *   This file contains the global typedefs and defines.
 *
 *
 * This software is owned by Qorvo Inc
 * and protected under applicable copyright laws.
 * It is delivered under the terms of the license
 * and is intended and supplied for use solely and
 * exclusively with products manufactured by
 * Qorvo Inc.
 *
 *
 * THIS SOFTWARE IS PROVIDED IN AN "AS IS"
 * CONDITION. NO WARRANTIES, WHETHER EXPRESS,
 * IMPLIED OR STATUTORY, INCLUDING, BUT NOT
 * LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * QORVO INC. SHALL NOT, IN ANY
 * CIRCUMSTANCES, BE LIABLE FOR SPECIAL,
 * INCIDENTAL OR CONSEQUENTIAL DAMAGES,
 * FOR ANY REASON WHATSOEVER.
 *
 * $Header$
 * $Change$
 * $DateTime$
 *
 * Alternatively, this software may be distributed under the terms of the
 * GNU General Public License ("GPL") version 2 as published by the Free
 * Software Foundation.
 *
 */

#ifndef _GLOBAL_H_
#define _GLOBAL_H_

#include "compiler.h"

/*****************************************************************************
 * Compile time verification
 *****************************************************************************/

/** Check a conditon at compile time.
 * this macro will produce a compile error if the condition x is false
 * the error might be strange however,
 * the error will be that the size of the array is negative, which is illegal in C.
 * You can use it both as a statement and an expression, but not at file level.
 * if used with a condition that is not compile-time-constant, it will pass
 */
#ifndef COMPILE_TIME_ASSERT
#define COMPILE_TIME_ASSERT(x)  ((void) sizeof(int[1-2*((x) ? 0 : 1)]))
#endif

//auxiliary macro
#define GP_COMPILE_TIME_VERIFY_TRUE(R) (!!sizeof(struct { unsigned int verify_error_if_negative_size__: (R) ? 1 : -1; }))

/** Check a conditon at compile time.
 * this macro will produce a compile error if the condition x is false
 * it is an alternative for COMPILE_TIME_ASSERT:
 * it is usable at file level, whereas COMPILE_TIME_ASSERT is not
 * COMPILE_TIME_ASSERT is usable as expression (inside macros that return a value), GP_COMPILE_TIME_VERIFY is not.
 * if used with a condition that is not compile-time-constant, it will fail
 */
#ifndef __cplusplus
#define GP_COMPILE_TIME_VERIFY(R) extern int (* gp_verify_function__ (void)) [GP_COMPILE_TIME_VERIFY_TRUE (R)]
#else
#define GP_COMPILE_TIME_VERIFY(R) typedef char gp_verify_function__  [ (R) ? 1 : -1 ]
#endif

/*****************************************************************************
 * Common data types
 *****************************************************************************/

typedef uint8_t                     Bool;
typedef char                        Char;

typedef uint8_t                     UInt8;
typedef uint16_t                    UInt16;
typedef uint32_t                    UInt24;
typedef uint32_t                    UInt32;
typedef uint_fast8_t                UIntLoop;
typedef uint8_t                     UInt8Buffer;

typedef int8_t                      Int8;
typedef int16_t                     Int16;
typedef int32_t                     Int24;
typedef int32_t                     Int32;
typedef int_fast8_t                 IntLoop;

typedef uint8_t                     Byte;

typedef UInt8                       UQ2_6;
typedef UInt16                      UQ2_14;
typedef UInt16                      UQ8_8;
typedef Int16                       Q8_8;
typedef Int8                        Q1_7;
typedef Int16                       Q1_15;
typedef Int32                       Q1_31;
typedef Int32                       Q24_8; /* 8 decimal places */
typedef Int32                       Q8_24; /* 24 decimal places */

#define MILLIVOLT_TO_UQ2_14(mv) ( (UQ2_14) ((((UInt32)mv)<<14)/1000) )

#ifndef HAVE_NO_64BIT
typedef uint64_t                    UInt64;
typedef int64_t                     Int64;
#endif

GP_COMPILE_TIME_VERIFY(sizeof(Char)==1);
GP_COMPILE_TIME_VERIFY(sizeof(UInt8)==1);
GP_COMPILE_TIME_VERIFY(sizeof(UInt16)==2);
GP_COMPILE_TIME_VERIFY(sizeof(UInt32)==4);

//not all hosts have a UInt64, let's simulate one, including endianness
typedef struct UInt64Struct
{
#ifndef GP_BIG_ENDIAN
    //normal case, little endian
    UInt32 LSB;
    UInt32 MSB;
#else //GP_BIG_ENDIAN
    UInt32 MSB;
    UInt32 LSB;
#endif
} UInt64Struct_t;
typedef UInt64Struct_t MACAddress_t;

#ifdef GP_BIG_ENDIAN
#define MACADDRESS_INITIALIZER(msb, lsb) { (msb), (lsb) }
#else
#define MACADDRESS_INITIALIZER(msb, lsb) { (lsb), (msb) }
#endif

// Bluetooth device address (6 bytes)
typedef PACKED_PRE struct
{
    UInt8 addr[6];
} PACKED_POST BtDeviceAddress_t;

GP_COMPILE_TIME_VERIFY(sizeof(BtDeviceAddress_t) == 6);


//Define UIntPtr and UIntPtr_P in compiler.h

#ifndef __cplusplus
#ifndef false
#define false   ((Bool) 0)
#endif
#ifndef true
#define true    ((Bool) !false)
#endif
#endif

#include <stddef.h>

#define GP_API extern

typedef void (* void_func) (void);

/*****************************************************************************
 * Helper macros
 *****************************************************************************/
#if !defined(__KERNEL__) && !defined(__cplusplus)
#ifndef min
#define min(a,b)            ((b) < (a) ? (b) : (a))
#endif
#ifndef max
#define max(a,b)            ((a) < (b) ? (b) : (a))
#endif
#ifndef clamp
#define clamp(val,a,b)           (min(max(val, a), b))
#endif
#endif // __KERNEL__ && !__cplusplus

#ifndef dist
#define dist(a,b)           ((a) < (b) ? ((b) - (a)) : ((a) - (b)))
#endif
#ifndef div_ceil
#define div_ceil(nr,div)    ( nr>=0 ? (((nr)+((div)-1))/(div)) : (((nr)+(0      ))/(div)) )
#endif
#ifndef div_round
