TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.5.LTS *
       3                    ;* Date/Time created: Sun Mar 27 17:11:52 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wifi/sln
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.5.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wifi
      13                            .global g_fNetIfCB
      14 00000000                   .data

   15639                            .dwattr $C$DW$987, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsock.
   15640                            .dwattr $C$DW$987, DW_AT_decl_line(0x146)
   15641                            .dwattr $C$DW$987, DW_AT_decl_column(0x05)
   15642                    
   15643                    $C$DW$988       .dwtag  DW_TAG_enumerator
   15644                            .dwattr $C$DW$988, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
   15645                            .dwattr $C$DW$988, DW_AT_const_value(0x04)
   15646                            .dwattr $C$DW$988, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsock.
   15647                            .dwattr $C$DW$988, DW_AT_decl_line(0x147)
   15648                            .dwattr $C$DW$988, DW_AT_decl_column(0x05)
   15649                    
   15650                    $C$DW$989       .dwtag  DW_TAG_enumerator
   15651                            .dwattr $C$DW$989, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
   15652                            .dwattr $C$DW$989, DW_AT_const_value(0x05)
   15653                            .dwattr $C$DW$989, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsock.
   15654                            .dwattr $C$DW$989, DW_AT_decl_line(0x148)
   15655                            .dwattr $C$DW$989, DW_AT_decl_column(0x05)
   15656                    
   15657                    $C$DW$990       .dwtag  DW_TAG_enumerator
   15658                            .dwattr $C$DW$990, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
   15659                            .dwattr $C$DW$990, DW_AT_const_value(0x06)
   15660                            .dwattr $C$DW$990, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsock.
   15661                            .dwattr $C$DW$990, DW_AT_decl_line(0x149)
   15662                            .dwattr $C$DW$990, DW_AT_decl_column(0x05)
   15663                    
   15664                            .dwattr $C$DW$T$672, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsoc
   15665                            .dwattr $C$DW$T$672, DW_AT_decl_line(0x143)
   15666                            .dwattr $C$DW$T$672, DW_AT_decl_column(0x01)
   15667                            .dwendtag $C$DW$T$672
   15668                    
   15669                    $C$DW$T$673     .dwtag  DW_TAG_typedef
   15670                            .dwattr $C$DW$T$673, DW_AT_name("SlNetSockTxInhibitThreshold_e")
   15671                            .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$672)
   15672                            .dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
   15673                            .dwattr $C$DW$T$673, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetsoc
   15674                            .dwattr $C$DW$T$673, DW_AT_decl_line(0x14a)
   15675                            .dwattr $C$DW$T$673, DW_AT_decl_column(0x03)
   15676                    
   15677                    
   15678                    $C$DW$T$674     .dwtag  DW_TAG_enumeration_type
   15679                            .dwattr $C$DW$T$674, DW_AT_byte_size(0x01)
   15680                    $C$DW$991       .dwtag  DW_TAG_enumerator
   15681                            .dwattr $C$DW$991, DW_AT_name("SLNETIF_STATE_DISABLE")
   15682                            .dwattr $C$DW$991, DW_AT_const_value(0x00)
   15683                            .dwattr $C$DW$991, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetif.h"
   15684                            .dwattr $C$DW$991, DW_AT_decl_line(0x62)
   15685                            .dwattr $C$DW$991, DW_AT_decl_column(0x05)
   15686                    
   15687                    $C$DW$992       .dwtag  DW_TAG_enumerator
   15688                            .dwattr $C$DW$992, DW_AT_name("SLNETIF_STATE_ENABLE")
   15689                            .dwattr $C$DW$992, DW_AT_const_value(0x01)
   15690                            .dwattr $C$DW$992, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetif.h"
   15691                            .dwattr $C$DW$992, DW_AT_decl_line(0x63)
   15692                            .dwattr $C$DW$992, DW_AT_decl_column(0x05)
   15693                    
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  330

   15694                            .dwattr $C$DW$T$674, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetif.
   15695                            .dwattr $C$DW$T$674, DW_AT_decl_line(0x61)
   15696                            .dwattr $C$DW$T$674, DW_AT_decl_column(0x01)
   15697                            .dwendtag $C$DW$T$674
   15698                    
   15699                    $C$DW$T$675     .dwtag  DW_TAG_typedef
   15700                            .dwattr $C$DW$T$675, DW_AT_name("SlNetIfState_e")
   15701                            .dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$674)
   15702                            .dwattr $C$DW$T$675, DW_AT_language(DW_LANG_C)
   15703                            .dwattr $C$DW$T$675, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/net/slnetif.
   15704                            .dwattr $C$DW$T$675, DW_AT_decl_line(0x64)
   15705                            .dwattr $C$DW$T$675, DW_AT_decl_column(0x03)
   15706                    
   15707                    
   15708                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
   15709                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
   15710                    $C$DW$993       .dwtag  DW_TAG_member
   15711                            .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$6)
   15712                            .dwattr $C$DW$993, DW_AT_name("Type")
   15713                            .dwattr $C$DW$993, DW_AT_TI_symbol_name("Type")
   15714                            .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15715                            .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
   15716                            .dwattr $C$DW$993, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15717                            .dwattr $C$DW$993, DW_AT_decl_line(0x2e8)
   15718                            .dwattr $C$DW$993, DW_AT_decl_column(0x0b)
   15719                    
   15720                    $C$DW$994       .dwtag  DW_TAG_member
   15721                            .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$24)
   15722                            .dwattr $C$DW$994, DW_AT_name("Key")
   15723                            .dwattr $C$DW$994, DW_AT_TI_symbol_name("Key")
   15724                            .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15725                            .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
   15726                            .dwattr $C$DW$994, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15727                            .dwattr $C$DW$994, DW_AT_decl_line(0x2e9)
   15728                            .dwattr $C$DW$994, DW_AT_decl_column(0x0b)
   15729                    
   15730                    $C$DW$995       .dwtag  DW_TAG_member
   15731                            .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$6)
   15732                            .dwattr $C$DW$995, DW_AT_name("KeyLen")
   15733                            .dwattr $C$DW$995, DW_AT_TI_symbol_name("KeyLen")
   15734                            .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15735                            .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
   15736                            .dwattr $C$DW$995, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15737                            .dwattr $C$DW$995, DW_AT_decl_line(0x2ea)
   15738                            .dwattr $C$DW$995, DW_AT_decl_column(0x0b)
   15739                    
   15740                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15741                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2e7)
   15742                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
   15743                            .dwendtag $C$DW$T$25
   15744                    
   15745                    $C$DW$T$74      .dwtag  DW_TAG_typedef
   15746                            .dwattr $C$DW$T$74, DW_AT_name("SlWlanSecParams_t")
   15747                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$25)
   15748                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  331

   15749                            .dwattr $C$DW$T$74, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15750                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x2eb)
   15751                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x02)
   15752                    
   15753                    $C$DW$T$676     .dwtag  DW_TAG_const_type
   15754                            .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$74)
   15755                    
   15756                    $C$DW$T$677     .dwtag  DW_TAG_pointer_type
   15757                            .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$676)
   15758                            .dwattr $C$DW$T$677, DW_AT_address_class(0x20)
   15759                    
   15760                    $C$DW$T$678     .dwtag  DW_TAG_pointer_type
   15761                            .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$74)
   15762                            .dwattr $C$DW$T$678, DW_AT_address_class(0x20)
   15763                    
   15764                    
   15765                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
   15766                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
   15767                    $C$DW$996       .dwtag  DW_TAG_member
   15768                            .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$24)
   15769                            .dwattr $C$DW$996, DW_AT_name("User")
   15770                            .dwattr $C$DW$996, DW_AT_TI_symbol_name("User")
   15771                            .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15772                            .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
   15773                            .dwattr $C$DW$996, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15774                            .dwattr $C$DW$996, DW_AT_decl_line(0x2ef)
   15775                            .dwattr $C$DW$996, DW_AT_decl_column(0x0b)
   15776                    
   15777                    $C$DW$997       .dwtag  DW_TAG_member
   15778                            .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$6)
   15779                            .dwattr $C$DW$997, DW_AT_name("UserLen")
   15780                            .dwattr $C$DW$997, DW_AT_TI_symbol_name("UserLen")
   15781                            .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15782                            .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
   15783                            .dwattr $C$DW$997, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15784                            .dwattr $C$DW$997, DW_AT_decl_line(0x2f0)
   15785                            .dwattr $C$DW$997, DW_AT_decl_column(0x0b)
   15786                    
   15787                    $C$DW$998       .dwtag  DW_TAG_member
   15788                            .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$24)
   15789                            .dwattr $C$DW$998, DW_AT_name("AnonUser")
   15790                            .dwattr $C$DW$998, DW_AT_TI_symbol_name("AnonUser")
   15791                            .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15792                            .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
   15793                            .dwattr $C$DW$998, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
   15794                            .dwattr $C$DW$998, DW_AT_decl_line(0x2f1)
   15795                            .dwattr $C$DW$998, DW_AT_decl_column(0x0b)
   15796                    
   15797                    $C$DW$999       .dwtag  DW_TAG_member
   15798                            .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$6)
   15799                            .dwattr $C$DW$999, DW_AT_name("AnonUserLen")
   15800                            .dwattr $C$DW$999, DW_AT_TI_symbol_name("AnonUserLen")
   15801                            .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15802                            .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
   15803                            .dwattr $C$DW$999, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/wi
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  332

   15804                            .dwattr $C$DW$999, DW_AT_decl_line(0x2f2)
   15805                            .dwattr $C$DW$999, DW_AT_decl_column(0x0b)
   15806                    
   15807                    $C$DW$1000      .dwtag  DW_TAG_member
   15808                            .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$6)
   15809                            .dwattr $C$DW$1000, DW_AT_name("CertIndex")
   15810                            .dwattr $C$DW$1000, DW_AT_TI_symbol_name("CertIndex")
   15811                            .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15812                            .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
   15813                            .dwattr $C$DW$1000, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15814                            .dwattr $C$DW$1000, DW_AT_decl_line(0x2f3)
   15815                            .dwattr $C$DW$1000, DW_AT_decl_column(0x0b)
   15816                    
   15817                    $C$DW$1001      .dwtag  DW_TAG_member
   15818                            .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$13)
   15819                            .dwattr $C$DW$1001, DW_AT_name("EapMethod")
   15820                            .dwattr $C$DW$1001, DW_AT_TI_symbol_name("EapMethod")
   15821                            .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15822                            .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
   15823                            .dwattr $C$DW$1001, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15824                            .dwattr $C$DW$1001, DW_AT_decl_line(0x2f4)
   15825                            .dwattr $C$DW$1001, DW_AT_decl_column(0x0b)
   15826                    
   15827                            .dwattr $C$DW$T$26, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15828                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2ee)
   15829                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
   15830                            .dwendtag $C$DW$T$26
   15831                    
   15832                    $C$DW$T$75      .dwtag  DW_TAG_typedef
   15833                            .dwattr $C$DW$T$75, DW_AT_name("SlWlanSecParamsExt_t")
   15834                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
   15835                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
   15836                            .dwattr $C$DW$T$75, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15837                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2f5)
   15838                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
   15839                    
   15840                    $C$DW$T$679     .dwtag  DW_TAG_const_type
   15841                            .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$75)
   15842                    
   15843                    $C$DW$T$680     .dwtag  DW_TAG_pointer_type
   15844                            .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$679)
   15845                            .dwattr $C$DW$T$680, DW_AT_address_class(0x20)
   15846                    
   15847                    $C$DW$T$681     .dwtag  DW_TAG_pointer_type
   15848                            .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$75)
   15849                            .dwattr $C$DW$T$681, DW_AT_address_class(0x20)
   15850                    
   15851                    
   15852                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
   15853                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
   15854                    $C$DW$1002      .dwtag  DW_TAG_member
   15855                            .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$13)
   15856                            .dwattr $C$DW$1002, DW_AT_name("ChipId")
   15857                            .dwattr $C$DW$1002, DW_AT_TI_symbol_name("ChipId")
   15858                            .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  333

   15859                            .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
   15860                            .dwattr $C$DW$1002, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15861                            .dwattr $C$DW$1002, DW_AT_decl_line(0x127)
   15862                            .dwattr $C$DW$1002, DW_AT_decl_column(0x0d)
   15863                    
   15864                    $C$DW$1003      .dwtag  DW_TAG_member
   15865                            .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$13)
   15866                            .dwattr $C$DW$1003, DW_AT_name("MoreData")
   15867                            .dwattr $C$DW$1003, DW_AT_TI_symbol_name("MoreData")
   15868                            .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15869                            .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
   15870                            .dwattr $C$DW$1003, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15871                            .dwattr $C$DW$1003, DW_AT_decl_line(0x128)
   15872                            .dwattr $C$DW$1003, DW_AT_decl_column(0x0d)
   15873                    
   15874                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15875                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x126)
   15876                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
   15877                            .dwendtag $C$DW$T$27
   15878                    
   15879                    $C$DW$T$682     .dwtag  DW_TAG_typedef
   15880                            .dwattr $C$DW$T$682, DW_AT_name("SlDeviceInitInfo_t")
   15881                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$27)
   15882                            .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
   15883                            .dwattr $C$DW$T$682, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   15884                            .dwattr $C$DW$T$682, DW_AT_decl_line(0x129)
   15885                            .dwattr $C$DW$T$682, DW_AT_decl_column(0x02)
   15886                    
   15887                    $C$DW$T$683     .dwtag  DW_TAG_pointer_type
   15888                            .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$682)
   15889                            .dwattr $C$DW$T$683, DW_AT_address_class(0x20)
   15890                    
   15891                    
   15892                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
   15893                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x28)
   15894                    $C$DW$1004      .dwtag  DW_TAG_member
   15895                            .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$6)
   15896                            .dwattr $C$DW$1004, DW_AT_name("ProvisioningStatus")
   15897                            .dwattr $C$DW$1004, DW_AT_TI_symbol_name("ProvisioningStatus")
   15898                            .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15899                            .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
   15900                            .dwattr $C$DW$1004, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15901                            .dwattr $C$DW$1004, DW_AT_decl_line(0x28e)
   15902                            .dwattr $C$DW$1004, DW_AT_decl_column(0x0a)
   15903                    
   15904                    $C$DW$1005      .dwtag  DW_TAG_member
   15905                            .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$6)
   15906                            .dwattr $C$DW$1005, DW_AT_name("Role")
   15907                            .dwattr $C$DW$1005, DW_AT_TI_symbol_name("Role")
   15908                            .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15909                            .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
   15910                            .dwattr $C$DW$1005, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15911                            .dwattr $C$DW$1005, DW_AT_decl_line(0x28f)
   15912                            .dwattr $C$DW$1005, DW_AT_decl_column(0x0a)
   15913                    
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  334

   15914                    $C$DW$1006      .dwtag  DW_TAG_member
   15915                            .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$6)
   15916                            .dwattr $C$DW$1006, DW_AT_name("WlanStatus")
   15917                            .dwattr $C$DW$1006, DW_AT_TI_symbol_name("WlanStatus")
   15918                            .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15919                            .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
   15920                            .dwattr $C$DW$1006, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15921                            .dwattr $C$DW$1006, DW_AT_decl_line(0x290)
   15922                            .dwattr $C$DW$1006, DW_AT_decl_column(0x0a)
   15923                    
   15924                    $C$DW$1007      .dwtag  DW_TAG_member
   15925                            .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$6)
   15926                            .dwattr $C$DW$1007, DW_AT_name("Ssidlen")
   15927                            .dwattr $C$DW$1007, DW_AT_TI_symbol_name("Ssidlen")
   15928                            .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15929                            .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
   15930                            .dwattr $C$DW$1007, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15931                            .dwattr $C$DW$1007, DW_AT_decl_line(0x291)
   15932                            .dwattr $C$DW$1007, DW_AT_decl_column(0x0a)
   15933                    
   15934                    $C$DW$1008      .dwtag  DW_TAG_member
   15935                            .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$28)
   15936                            .dwattr $C$DW$1008, DW_AT_name("Ssid")
   15937                            .dwattr $C$DW$1008, DW_AT_TI_symbol_name("Ssid")
   15938                            .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15939                            .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
   15940                            .dwattr $C$DW$1008, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15941                            .dwattr $C$DW$1008, DW_AT_decl_line(0x292)
   15942                            .dwattr $C$DW$1008, DW_AT_decl_column(0x0a)
   15943                    
   15944                    $C$DW$1009      .dwtag  DW_TAG_member
   15945                            .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$13)
   15946                            .dwattr $C$DW$1009, DW_AT_name("Reserved")
   15947                            .dwattr $C$DW$1009, DW_AT_TI_symbol_name("Reserved")
   15948                            .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   15949                            .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
   15950                            .dwattr $C$DW$1009, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15951                            .dwattr $C$DW$1009, DW_AT_decl_line(0x293)
   15952                            .dwattr $C$DW$1009, DW_AT_decl_column(0x0a)
   15953                    
   15954                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15955                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x28d)
   15956                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
   15957                            .dwendtag $C$DW$T$29
   15958                    
   15959                    $C$DW$T$347     .dwtag  DW_TAG_typedef
   15960                            .dwattr $C$DW$T$347, DW_AT_name("SlWlanEventProvisioningStatus_t")
   15961                            .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$29)
   15962                            .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   15963                            .dwattr $C$DW$T$347, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   15964                            .dwattr $C$DW$T$347, DW_AT_decl_line(0x294)
   15965                            .dwattr $C$DW$T$347, DW_AT_decl_column(0x02)
   15966                    
   15967                    $C$DW$T$684     .dwtag  DW_TAG_pointer_type
   15968                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$347)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  335

   15969                            .dwattr $C$DW$T$684, DW_AT_address_class(0x20)
   15970                    
   15971                    
   15972                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
   15973                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
   15974                    $C$DW$1010      .dwtag  DW_TAG_member
   15975                            .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$6)
   15976                            .dwattr $C$DW$1010, DW_AT_name("SsidLen")
   15977                            .dwattr $C$DW$1010, DW_AT_TI_symbol_name("SsidLen")
   15978                            .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15979                            .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
   15980                            .dwattr $C$DW$1010, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15981                            .dwattr $C$DW$1010, DW_AT_decl_line(0x249)
   15982                            .dwattr $C$DW$1010, DW_AT_decl_column(0x0d)
   15983                    
   15984                    $C$DW$1011      .dwtag  DW_TAG_member
   15985                            .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$28)
   15986                            .dwattr $C$DW$1011, DW_AT_name("SsidName")
   15987                            .dwattr $C$DW$1011, DW_AT_TI_symbol_name("SsidName")
   15988                            .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15989                            .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
   15990                            .dwattr $C$DW$1011, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   15991                            .dwattr $C$DW$1011, DW_AT_decl_line(0x24a)
   15992                            .dwattr $C$DW$1011, DW_AT_decl_column(0x0d)
   15993                    
   15994                    $C$DW$1012      .dwtag  DW_TAG_member
   15995                            .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$30)
   15996                            .dwattr $C$DW$1012, DW_AT_name("Bssid")
   15997                            .dwattr $C$DW$1012, DW_AT_TI_symbol_name("Bssid")
   15998                            .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   15999                            .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
   16000                            .dwattr $C$DW$1012, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16001                            .dwattr $C$DW$1012, DW_AT_decl_line(0x24b)
   16002                            .dwattr $C$DW$1012, DW_AT_decl_column(0x0d)
   16003                    
   16004                    $C$DW$1013      .dwtag  DW_TAG_member
   16005                            .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$6)
   16006                            .dwattr $C$DW$1013, DW_AT_name("Channel")
   16007                            .dwattr $C$DW$1013, DW_AT_TI_symbol_name("Channel")
   16008                            .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16009                            .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
   16010                            .dwattr $C$DW$1013, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16011                            .dwattr $C$DW$1013, DW_AT_decl_line(0x24c)
   16012                            .dwattr $C$DW$1013, DW_AT_decl_column(0x0d)
   16013                    
   16014                            .dwattr $C$DW$T$31, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16015                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x248)
   16016                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
   16017                            .dwendtag $C$DW$T$31
   16018                    
   16019                    $C$DW$T$335     .dwtag  DW_TAG_typedef
   16020                            .dwattr $C$DW$T$335, DW_AT_name("SlWlanEventConnect_t")
   16021                            .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$31)
   16022                            .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   16023                            .dwattr $C$DW$T$335, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  336

   16024                            .dwattr $C$DW$T$335, DW_AT_decl_line(0x24d)
   16025                            .dwattr $C$DW$T$335, DW_AT_decl_column(0x03)
   16026                    
   16027                    
   16028                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
   16029                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x28)
   16030                    $C$DW$1014      .dwtag  DW_TAG_member
   16031                            .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$6)
   16032                            .dwattr $C$DW$1014, DW_AT_name("SsidLen")
   16033                            .dwattr $C$DW$1014, DW_AT_TI_symbol_name("SsidLen")
   16034                            .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16035                            .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
   16036                            .dwattr $C$DW$1014, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16037                            .dwattr $C$DW$1014, DW_AT_decl_line(0x251)
   16038                            .dwattr $C$DW$1014, DW_AT_decl_column(0x0d)
   16039                    
   16040                    $C$DW$1015      .dwtag  DW_TAG_member
   16041                            .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$28)
   16042                            .dwattr $C$DW$1015, DW_AT_name("SsidName")
   16043                            .dwattr $C$DW$1015, DW_AT_TI_symbol_name("SsidName")
   16044                            .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16045                            .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
   16046                            .dwattr $C$DW$1015, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16047                            .dwattr $C$DW$1015, DW_AT_decl_line(0x252)
   16048                            .dwattr $C$DW$1015, DW_AT_decl_column(0x0d)
   16049                    
   16050                    $C$DW$1016      .dwtag  DW_TAG_member
   16051                            .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$30)
   16052                            .dwattr $C$DW$1016, DW_AT_name("Bssid")
   16053                            .dwattr $C$DW$1016, DW_AT_TI_symbol_name("Bssid")
   16054                            .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16055                            .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
   16056                            .dwattr $C$DW$1016, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16057                            .dwattr $C$DW$1016, DW_AT_decl_line(0x253)
   16058                            .dwattr $C$DW$1016, DW_AT_decl_column(0x0d)
   16059                    
   16060                    $C$DW$1017      .dwtag  DW_TAG_member
   16061                            .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$6)
   16062                            .dwattr $C$DW$1017, DW_AT_name("ReasonCode")
   16063                            .dwattr $C$DW$1017, DW_AT_TI_symbol_name("ReasonCode")
   16064                            .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16065                            .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
   16066                            .dwattr $C$DW$1017, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16067                            .dwattr $C$DW$1017, DW_AT_decl_line(0x254)
   16068                            .dwattr $C$DW$1017, DW_AT_decl_column(0x0d)
   16069                    
   16070                            .dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16071                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x250)
   16072                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
   16073                            .dwendtag $C$DW$T$32
   16074                    
   16075                    $C$DW$T$336     .dwtag  DW_TAG_typedef
   16076                            .dwattr $C$DW$T$336, DW_AT_name("SlWlanEventDisconnect_t")
   16077                            .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$32)
   16078                            .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  337

   16079                            .dwattr $C$DW$T$336, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16080                            .dwattr $C$DW$T$336, DW_AT_decl_line(0x255)
   16081                            .dwattr $C$DW$T$336, DW_AT_decl_column(0x03)
   16082                    
   16083                    
   16084                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
   16085                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
   16086                    $C$DW$1018      .dwtag  DW_TAG_member
   16087                            .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$30)
   16088                            .dwattr $C$DW$1018, DW_AT_name("Mac")
   16089                            .dwattr $C$DW$1018, DW_AT_TI_symbol_name("Mac")
   16090                            .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16091                            .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
   16092                            .dwattr $C$DW$1018, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16093                            .dwattr $C$DW$1018, DW_AT_decl_line(0x259)
   16094                            .dwattr $C$DW$1018, DW_AT_decl_column(0x0b)
   16095                    
   16096                    $C$DW$1019      .dwtag  DW_TAG_member
   16097                            .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$33)
   16098                            .dwattr $C$DW$1019, DW_AT_name("Padding")
   16099                            .dwattr $C$DW$1019, DW_AT_TI_symbol_name("Padding")
   16100                            .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16101                            .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
   16102                            .dwattr $C$DW$1019, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16103                            .dwattr $C$DW$1019, DW_AT_decl_line(0x25a)
   16104                            .dwattr $C$DW$1019, DW_AT_decl_column(0x0b)
   16105                    
   16106                            .dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16107                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x258)
   16108                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
   16109                            .dwendtag $C$DW$T$34
   16110                    
   16111                    $C$DW$T$337     .dwtag  DW_TAG_typedef
   16112                            .dwattr $C$DW$T$337, DW_AT_name("SlWlanEventSTAAdded_t")
   16113                            .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$34)
   16114                            .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   16115                            .dwattr $C$DW$T$337, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16116                            .dwattr $C$DW$T$337, DW_AT_decl_line(0x25b)
   16117                            .dwattr $C$DW$T$337, DW_AT_decl_column(0x02)
   16118                    
   16119                    $C$DW$T$338     .dwtag  DW_TAG_typedef
   16120                            .dwattr $C$DW$T$338, DW_AT_name("SlWlanEventSTARemoved_t")
   16121                            .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$34)
   16122                            .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   16123                            .dwattr $C$DW$T$338, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16124                            .dwattr $C$DW$T$338, DW_AT_decl_line(0x25b)
   16125                            .dwattr $C$DW$T$338, DW_AT_decl_column(0x19)
   16126                    
   16127                    
   16128                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
   16129                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x4c)
   16130                    $C$DW$1020      .dwtag  DW_TAG_member
   16131                            .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$6)
   16132                            .dwattr $C$DW$1020, DW_AT_name("SsidLen")
   16133                            .dwattr $C$DW$1020, DW_AT_TI_symbol_name("SsidLen")
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  338

   16134                            .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16135                            .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
   16136                            .dwattr $C$DW$1020, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16137                            .dwattr $C$DW$1020, DW_AT_decl_line(0x260)
   16138                            .dwattr $C$DW$1020, DW_AT_decl_column(0x0d)
   16139                    
   16140                    $C$DW$1021      .dwtag  DW_TAG_member
   16141                            .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$28)
   16142                            .dwattr $C$DW$1021, DW_AT_name("SsidName")
   16143                            .dwattr $C$DW$1021, DW_AT_TI_symbol_name("SsidName")
   16144                            .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16145                            .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
   16146                            .dwattr $C$DW$1021, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16147                            .dwattr $C$DW$1021, DW_AT_decl_line(0x261)
   16148                            .dwattr $C$DW$1021, DW_AT_decl_column(0x0d)
   16149                    
   16150                    $C$DW$1022      .dwtag  DW_TAG_member
   16151                            .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$30)
   16152                            .dwattr $C$DW$1022, DW_AT_name("Bssid")
   16153                            .dwattr $C$DW$1022, DW_AT_TI_symbol_name("Bssid")
   16154                            .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16155                            .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
   16156                            .dwattr $C$DW$1022, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16157                            .dwattr $C$DW$1022, DW_AT_decl_line(0x262)
   16158                            .dwattr $C$DW$1022, DW_AT_decl_column(0x0d)
   16159                    
   16160                    $C$DW$1023      .dwtag  DW_TAG_member
   16161                            .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$6)
   16162                            .dwattr $C$DW$1023, DW_AT_name("Reserved")
   16163                            .dwattr $C$DW$1023, DW_AT_TI_symbol_name("Reserved")
   16164                            .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16165                            .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
   16166                            .dwattr $C$DW$1023, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16167                            .dwattr $C$DW$1023, DW_AT_decl_line(0x263)
   16168                            .dwattr $C$DW$1023, DW_AT_decl_column(0x0d)
   16169                    
   16170                    $C$DW$1024      .dwtag  DW_TAG_member
   16171                            .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$6)
   16172                            .dwattr $C$DW$1024, DW_AT_name("GoDeviceNameLen")
   16173                            .dwattr $C$DW$1024, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16174                            .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16175                            .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
   16176                            .dwattr $C$DW$1024, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16177                            .dwattr $C$DW$1024, DW_AT_decl_line(0x264)
   16178                            .dwattr $C$DW$1024, DW_AT_decl_column(0x0d)
   16179                    
   16180                    $C$DW$1025      .dwtag  DW_TAG_member
   16181                            .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$28)
   16182                            .dwattr $C$DW$1025, DW_AT_name("GoDeviceName")
   16183                            .dwattr $C$DW$1025, DW_AT_TI_symbol_name("GoDeviceName")
   16184                            .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   16185                            .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
   16186                            .dwattr $C$DW$1025, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16187                            .dwattr $C$DW$1025, DW_AT_decl_line(0x265)
   16188                            .dwattr $C$DW$1025, DW_AT_decl_column(0x0d)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  339

   16189                    
   16190                    $C$DW$1026      .dwtag  DW_TAG_member
   16191                            .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$35)
   16192                            .dwattr $C$DW$1026, DW_AT_name("Padding")
   16193                            .dwattr $C$DW$1026, DW_AT_TI_symbol_name("Padding")
   16194                            .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   16195                            .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
   16196                            .dwattr $C$DW$1026, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16197                            .dwattr $C$DW$1026, DW_AT_decl_line(0x266)
   16198                            .dwattr $C$DW$1026, DW_AT_decl_column(0x0d)
   16199                    
   16200                            .dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16201                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x25f)
   16202                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
   16203                            .dwendtag $C$DW$T$36
   16204                    
   16205                    $C$DW$T$339     .dwtag  DW_TAG_typedef
   16206                            .dwattr $C$DW$T$339, DW_AT_name("SlWlanEventP2PConnect_t")
   16207                            .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$36)
   16208                            .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   16209                            .dwattr $C$DW$T$339, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16210                            .dwattr $C$DW$T$339, DW_AT_decl_line(0x267)
   16211                            .dwattr $C$DW$T$339, DW_AT_decl_column(0x03)
   16212                    
   16213                    
   16214                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
   16215                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x4c)
   16216                    $C$DW$1027      .dwtag  DW_TAG_member
   16217                            .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$6)
   16218                            .dwattr $C$DW$1027, DW_AT_name("SsidLen")
   16219                            .dwattr $C$DW$1027, DW_AT_TI_symbol_name("SsidLen")
   16220                            .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16221                            .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
   16222                            .dwattr $C$DW$1027, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16223                            .dwattr $C$DW$1027, DW_AT_decl_line(0x26b)
   16224                            .dwattr $C$DW$1027, DW_AT_decl_column(0x0d)
   16225                    
   16226                    $C$DW$1028      .dwtag  DW_TAG_member
   16227                            .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$28)
   16228                            .dwattr $C$DW$1028, DW_AT_name("SsidName")
   16229                            .dwattr $C$DW$1028, DW_AT_TI_symbol_name("SsidName")
   16230                            .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16231                            .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
   16232                            .dwattr $C$DW$1028, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16233                            .dwattr $C$DW$1028, DW_AT_decl_line(0x26c)
   16234                            .dwattr $C$DW$1028, DW_AT_decl_column(0x0d)
   16235                    
   16236                    $C$DW$1029      .dwtag  DW_TAG_member
   16237                            .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$30)
   16238                            .dwattr $C$DW$1029, DW_AT_name("Bssid")
   16239                            .dwattr $C$DW$1029, DW_AT_TI_symbol_name("Bssid")
   16240                            .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16241                            .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
   16242                            .dwattr $C$DW$1029, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16243                            .dwattr $C$DW$1029, DW_AT_decl_line(0x26d)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  340

   16244                            .dwattr $C$DW$1029, DW_AT_decl_column(0x0d)
   16245                    
   16246                    $C$DW$1030      .dwtag  DW_TAG_member
   16247                            .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$6)
   16248                            .dwattr $C$DW$1030, DW_AT_name("ReasonCode")
   16249                            .dwattr $C$DW$1030, DW_AT_TI_symbol_name("ReasonCode")
   16250                            .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16251                            .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
   16252                            .dwattr $C$DW$1030, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16253                            .dwattr $C$DW$1030, DW_AT_decl_line(0x26e)
   16254                            .dwattr $C$DW$1030, DW_AT_decl_column(0x0d)
   16255                    
   16256                    $C$DW$1031      .dwtag  DW_TAG_member
   16257                            .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$6)
   16258                            .dwattr $C$DW$1031, DW_AT_name("GoDeviceNameLen")
   16259                            .dwattr $C$DW$1031, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16260                            .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16261                            .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
   16262                            .dwattr $C$DW$1031, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16263                            .dwattr $C$DW$1031, DW_AT_decl_line(0x26f)
   16264                            .dwattr $C$DW$1031, DW_AT_decl_column(0x0d)
   16265                    
   16266                    $C$DW$1032      .dwtag  DW_TAG_member
   16267                            .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$28)
   16268                            .dwattr $C$DW$1032, DW_AT_name("GoDeviceName")
   16269                            .dwattr $C$DW$1032, DW_AT_TI_symbol_name("GoDeviceName")
   16270                            .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   16271                            .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
   16272                            .dwattr $C$DW$1032, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16273                            .dwattr $C$DW$1032, DW_AT_decl_line(0x270)
   16274                            .dwattr $C$DW$1032, DW_AT_decl_column(0x0d)
   16275                    
   16276                    $C$DW$1033      .dwtag  DW_TAG_member
   16277                            .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$35)
   16278                            .dwattr $C$DW$1033, DW_AT_name("Padding")
   16279                            .dwattr $C$DW$1033, DW_AT_TI_symbol_name("Padding")
   16280                            .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   16281                            .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
   16282                            .dwattr $C$DW$1033, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16283                            .dwattr $C$DW$1033, DW_AT_decl_line(0x271)
   16284                            .dwattr $C$DW$1033, DW_AT_decl_column(0x0d)
   16285                    
   16286                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16287                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x26a)
   16288                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
   16289                            .dwendtag $C$DW$T$37
   16290                    
   16291                    $C$DW$T$340     .dwtag  DW_TAG_typedef
   16292                            .dwattr $C$DW$T$340, DW_AT_name("SlWlanEventP2PDisconnect_t")
   16293                            .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$37)
   16294                            .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   16295                            .dwattr $C$DW$T$340, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16296                            .dwattr $C$DW$T$340, DW_AT_decl_line(0x272)
   16297                            .dwattr $C$DW$T$340, DW_AT_decl_column(0x03)
   16298                    
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  341

   16299                    
   16300                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
   16301                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x48)
   16302                    $C$DW$1034      .dwtag  DW_TAG_member
   16303                            .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$30)
   16304                            .dwattr $C$DW$1034, DW_AT_name("Mac")
   16305                            .dwattr $C$DW$1034, DW_AT_TI_symbol_name("Mac")
   16306                            .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16307                            .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
   16308                            .dwattr $C$DW$1034, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16309                            .dwattr $C$DW$1034, DW_AT_decl_line(0x276)
   16310                            .dwattr $C$DW$1034, DW_AT_decl_column(0x0d)
   16311                    
   16312                    $C$DW$1035      .dwtag  DW_TAG_member
   16313                            .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$6)
   16314                            .dwattr $C$DW$1035, DW_AT_name("ClDeviceNameLen")
   16315                            .dwattr $C$DW$1035, DW_AT_TI_symbol_name("ClDeviceNameLen")
   16316                            .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16317                            .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
   16318                            .dwattr $C$DW$1035, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16319                            .dwattr $C$DW$1035, DW_AT_decl_line(0x277)
   16320                            .dwattr $C$DW$1035, DW_AT_decl_column(0x0d)
   16321                    
   16322                    $C$DW$1036      .dwtag  DW_TAG_member
   16323                            .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$28)
   16324                            .dwattr $C$DW$1036, DW_AT_name("ClDeviceName")
   16325                            .dwattr $C$DW$1036, DW_AT_TI_symbol_name("ClDeviceName")
   16326                            .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16327                            .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
   16328                            .dwattr $C$DW$1036, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16329                            .dwattr $C$DW$1036, DW_AT_decl_line(0x278)
   16330                            .dwattr $C$DW$1036, DW_AT_decl_column(0x0d)
   16331                    
   16332                    $C$DW$1037      .dwtag  DW_TAG_member
   16333                            .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$6)
   16334                            .dwattr $C$DW$1037, DW_AT_name("OwnSsidLen")
   16335                            .dwattr $C$DW$1037, DW_AT_TI_symbol_name("OwnSsidLen")
   16336                            .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16337                            .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
   16338                            .dwattr $C$DW$1037, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16339                            .dwattr $C$DW$1037, DW_AT_decl_line(0x279)
   16340                            .dwattr $C$DW$1037, DW_AT_decl_column(0x0d)
   16341                    
   16342                    $C$DW$1038      .dwtag  DW_TAG_member
   16343                            .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$28)
   16344                            .dwattr $C$DW$1038, DW_AT_name("OwnSsid")
   16345                            .dwattr $C$DW$1038, DW_AT_TI_symbol_name("OwnSsid")
   16346                            .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16347                            .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
   16348                            .dwattr $C$DW$1038, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16349                            .dwattr $C$DW$1038, DW_AT_decl_line(0x27a)
   16350                            .dwattr $C$DW$1038, DW_AT_decl_column(0x0d)
   16351                    
   16352                            .dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16353                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x275)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  342

   16354                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
   16355                            .dwendtag $C$DW$T$38
   16356                    
   16357                    $C$DW$T$341     .dwtag  DW_TAG_typedef
   16358                            .dwattr $C$DW$T$341, DW_AT_name("SlWlanEventP2PClientAdded_t")
   16359                            .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$38)
   16360                            .dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
   16361                            .dwattr $C$DW$T$341, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16362                            .dwattr $C$DW$T$341, DW_AT_decl_line(0x27b)
   16363                            .dwattr $C$DW$T$341, DW_AT_decl_column(0x02)
   16364                    
   16365                    $C$DW$T$342     .dwtag  DW_TAG_typedef
   16366                            .dwattr $C$DW$T$342, DW_AT_name("SlWlanEventP2PClientRemoved_t")
   16367                            .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$38)
   16368                            .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
   16369                            .dwattr $C$DW$T$342, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16370                            .dwattr $C$DW$T$342, DW_AT_decl_line(0x27b)
   16371                            .dwattr $C$DW$T$342, DW_AT_decl_column(0x1f)
   16372                    
   16373                    
   16374                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
   16375                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x28)
   16376                    $C$DW$1039      .dwtag  DW_TAG_member
   16377                            .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$6)
   16378                            .dwattr $C$DW$1039, DW_AT_name("GoDeviceNameLen")
   16379                            .dwattr $C$DW$1039, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16380                            .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16381                            .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
   16382                            .dwattr $C$DW$1039, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16383                            .dwattr $C$DW$1039, DW_AT_decl_line(0x27f)
   16384                            .dwattr $C$DW$1039, DW_AT_decl_column(0x0d)
   16385                    
   16386                    $C$DW$1040      .dwtag  DW_TAG_member
   16387                            .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$28)
   16388                            .dwattr $C$DW$1040, DW_AT_name("GoDeviceName")
   16389                            .dwattr $C$DW$1040, DW_AT_TI_symbol_name("GoDeviceName")
   16390                            .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16391                            .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
   16392                            .dwattr $C$DW$1040, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16393                            .dwattr $C$DW$1040, DW_AT_decl_line(0x280)
   16394                            .dwattr $C$DW$1040, DW_AT_decl_column(0x0d)
   16395                    
   16396                    $C$DW$1041      .dwtag  DW_TAG_member
   16397                            .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$30)
   16398                            .dwattr $C$DW$1041, DW_AT_name("Mac")
   16399                            .dwattr $C$DW$1041, DW_AT_TI_symbol_name("Mac")
   16400                            .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16401                            .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
   16402                            .dwattr $C$DW$1041, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16403                            .dwattr $C$DW$1041, DW_AT_decl_line(0x281)
   16404                            .dwattr $C$DW$1041, DW_AT_decl_column(0x0d)
   16405                    
   16406                    $C$DW$1042      .dwtag  DW_TAG_member
   16407                            .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$6)
   16408                            .dwattr $C$DW$1042, DW_AT_name("WpsMethod")
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  343

   16409                            .dwattr $C$DW$1042, DW_AT_TI_symbol_name("WpsMethod")
   16410                            .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16411                            .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
   16412                            .dwattr $C$DW$1042, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16413                            .dwattr $C$DW$1042, DW_AT_decl_line(0x282)
   16414                            .dwattr $C$DW$1042, DW_AT_decl_column(0x0d)
   16415                    
   16416                            .dwattr $C$DW$T$39, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16417                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x27e)
   16418                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
   16419                            .dwendtag $C$DW$T$39
   16420                    
   16421                    $C$DW$T$343     .dwtag  DW_TAG_typedef
   16422                            .dwattr $C$DW$T$343, DW_AT_name("SlWlanEventP2PDevFound_t")
   16423                            .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$39)
   16424                            .dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
   16425                            .dwattr $C$DW$T$343, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16426                            .dwattr $C$DW$T$343, DW_AT_decl_line(0x283)
   16427                            .dwattr $C$DW$T$343, DW_AT_decl_column(0x02)
   16428                    
   16429                    $C$DW$T$344     .dwtag  DW_TAG_typedef
   16430                            .dwattr $C$DW$T$344, DW_AT_name("SlWlanEventP2PRequest_t")
   16431                            .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$39)
   16432                            .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   16433                            .dwattr $C$DW$T$344, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16434                            .dwattr $C$DW$T$344, DW_AT_decl_line(0x283)
   16435                            .dwattr $C$DW$T$344, DW_AT_decl_column(0x1c)
   16436                    
   16437                    
   16438                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
   16439                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
   16440                    $C$DW$1043      .dwtag  DW_TAG_member
   16441                            .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$9)
   16442                            .dwattr $C$DW$1043, DW_AT_name("Status")
   16443                            .dwattr $C$DW$1043, DW_AT_TI_symbol_name("Status")
   16444                            .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16445                            .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
   16446                            .dwattr $C$DW$1043, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16447                            .dwattr $C$DW$1043, DW_AT_decl_line(0x288)
   16448                            .dwattr $C$DW$1043, DW_AT_decl_column(0x0d)
   16449                    
   16450                    $C$DW$1044      .dwtag  DW_TAG_member
   16451                            .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$9)
   16452                            .dwattr $C$DW$1044, DW_AT_name("Padding")
   16453                            .dwattr $C$DW$1044, DW_AT_TI_symbol_name("Padding")
   16454                            .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16455                            .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
   16456                            .dwattr $C$DW$1044, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16457                            .dwattr $C$DW$1044, DW_AT_decl_line(0x289)
   16458                            .dwattr $C$DW$1044, DW_AT_decl_column(0x0d)
   16459                    
   16460                            .dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16461                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x287)
   16462                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
   16463                            .dwendtag $C$DW$T$40
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  344

   16464                    
   16465                    $C$DW$T$345     .dwtag  DW_TAG_typedef
   16466                            .dwattr $C$DW$T$345, DW_AT_name("SlWlanEventP2PConnectFail_t")
   16467                            .dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$40)
   16468                            .dwattr $C$DW$T$345, DW_AT_language(DW_LANG_C)
   16469                            .dwattr $C$DW$T$345, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16470                            .dwattr $C$DW$T$345, DW_AT_decl_line(0x28a)
   16471                            .dwattr $C$DW$T$345, DW_AT_decl_column(0x02)
   16472                    
   16473                    
   16474                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
   16475                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x09)
   16476                    $C$DW$1045      .dwtag  DW_TAG_member
   16477                            .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$6)
   16478                            .dwattr $C$DW$1045, DW_AT_name("Type")
   16479                            .dwattr $C$DW$1045, DW_AT_TI_symbol_name("Type")
   16480                            .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16481                            .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
   16482                            .dwattr $C$DW$1045, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16483                            .dwattr $C$DW$1045, DW_AT_decl_line(0x23a)
   16484                            .dwattr $C$DW$1045, DW_AT_decl_column(0x0d)
   16485                    
   16486                    $C$DW$1046      .dwtag  DW_TAG_member
   16487                            .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$41)
   16488                            .dwattr $C$DW$1046, DW_AT_name("UserActionIdBitmap")
   16489                            .dwattr $C$DW$1046, DW_AT_TI_symbol_name("UserActionIdBitmap")
   16490                            .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16491                            .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   16492                            .dwattr $C$DW$1046, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16493                            .dwattr $C$DW$1046, DW_AT_decl_line(0x23b)
   16494                            .dwattr $C$DW$1046, DW_AT_decl_column(0x0d)
   16495                    
   16496                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16497                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x239)
   16498                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
   16499                            .dwendtag $C$DW$T$42
   16500                    
   16501                    $C$DW$T$346     .dwtag  DW_TAG_typedef
   16502                            .dwattr $C$DW$T$346, DW_AT_name("SlWlanEventRxFilterInfo_t")
   16503                            .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$42)
   16504                            .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   16505                            .dwattr $C$DW$T$346, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16506                            .dwattr $C$DW$T$346, DW_AT_decl_line(0x23c)
   16507                            .dwattr $C$DW$T$346, DW_AT_decl_column(0x02)
   16508                    
   16509                    
   16510                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
   16511                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x4c)
   16512                    $C$DW$1047      .dwtag  DW_TAG_member
   16513                            .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$13)
   16514                            .dwattr $C$DW$1047, DW_AT_name("Status")
   16515                            .dwattr $C$DW$1047, DW_AT_TI_symbol_name("Status")
   16516                            .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16517                            .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   16518                            .dwattr $C$DW$1047, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  345

   16519                            .dwattr $C$DW$1047, DW_AT_decl_line(0x298)
   16520                            .dwattr $C$DW$1047, DW_AT_decl_column(0x0d)
   16521                    
   16522                    $C$DW$1048      .dwtag  DW_TAG_member
   16523                            .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$13)
   16524                            .dwattr $C$DW$1048, DW_AT_name("SsidLen")
   16525                            .dwattr $C$DW$1048, DW_AT_TI_symbol_name("SsidLen")
   16526                            .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16527                            .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   16528                            .dwattr $C$DW$1048, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16529                            .dwattr $C$DW$1048, DW_AT_decl_line(0x299)
   16530                            .dwattr $C$DW$1048, DW_AT_decl_column(0x0d)
   16531                    
   16532                    $C$DW$1049      .dwtag  DW_TAG_member
   16533                            .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$28)
   16534                            .dwattr $C$DW$1049, DW_AT_name("Ssid")
   16535                            .dwattr $C$DW$1049, DW_AT_TI_symbol_name("Ssid")
   16536                            .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16537                            .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   16538                            .dwattr $C$DW$1049, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16539                            .dwattr $C$DW$1049, DW_AT_decl_line(0x29a)
   16540                            .dwattr $C$DW$1049, DW_AT_decl_column(0x0d)
   16541                    
   16542                    $C$DW$1050      .dwtag  DW_TAG_member
   16543                            .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$13)
   16544                            .dwattr $C$DW$1050, DW_AT_name("ReservedLen")
   16545                            .dwattr $C$DW$1050, DW_AT_TI_symbol_name("ReservedLen")
   16546                            .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16547                            .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   16548                            .dwattr $C$DW$1050, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16549                            .dwattr $C$DW$1050, DW_AT_decl_line(0x29b)
   16550                            .dwattr $C$DW$1050, DW_AT_decl_column(0x0d)
   16551                    
   16552                    $C$DW$1051      .dwtag  DW_TAG_member
   16553                            .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$28)
   16554                            .dwattr $C$DW$1051, DW_AT_name("Reserved")
   16555                            .dwattr $C$DW$1051, DW_AT_TI_symbol_name("Reserved")
   16556                            .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   16557                            .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   16558                            .dwattr $C$DW$1051, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16559                            .dwattr $C$DW$1051, DW_AT_decl_line(0x29c)
   16560                            .dwattr $C$DW$1051, DW_AT_decl_column(0x0d)
   16561                    
   16562                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16563                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x297)
   16564                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
   16565                            .dwendtag $C$DW$T$43
   16566                    
   16567                    $C$DW$T$348     .dwtag  DW_TAG_typedef
   16568                            .dwattr $C$DW$T$348, DW_AT_name("SlWlanEventProvisioningProfileAdded_t")
   16569                            .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$43)
   16570                            .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
   16571                            .dwattr $C$DW$T$348, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16572                            .dwattr $C$DW$T$348, DW_AT_decl_line(0x29d)
   16573                            .dwattr $C$DW$T$348, DW_AT_decl_column(0x03)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  346

   16574                    
   16575                    
   16576                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
   16577                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
   16578                    $C$DW$1052      .dwtag  DW_TAG_member
   16579                            .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$6)
   16580                            .dwattr $C$DW$1052, DW_AT_name("Data")
   16581                            .dwattr $C$DW$1052, DW_AT_TI_symbol_name("Data")
   16582                            .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16583                            .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   16584                            .dwattr $C$DW$1052, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16585                            .dwattr $C$DW$1052, DW_AT_decl_line(0x2a1)
   16586                            .dwattr $C$DW$1052, DW_AT_decl_column(0x0a)
   16587                    
   16588                    $C$DW$1053      .dwtag  DW_TAG_member
   16589                            .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$6)
   16590                            .dwattr $C$DW$1053, DW_AT_name("TriggerId")
   16591                            .dwattr $C$DW$1053, DW_AT_TI_symbol_name("TriggerId")
   16592                            .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16593                            .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   16594                            .dwattr $C$DW$1053, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16595                            .dwattr $C$DW$1053, DW_AT_decl_line(0x2a2)
   16596                            .dwattr $C$DW$1053, DW_AT_decl_column(0x0a)
   16597                    
   16598                    $C$DW$1054      .dwtag  DW_TAG_member
   16599                            .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$33)
   16600                            .dwattr $C$DW$1054, DW_AT_name("Padding")
   16601                            .dwattr $C$DW$1054, DW_AT_TI_symbol_name("Padding")
   16602                            .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16603                            .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   16604                            .dwattr $C$DW$1054, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16605                            .dwattr $C$DW$1054, DW_AT_decl_line(0x2a3)
   16606                            .dwattr $C$DW$1054, DW_AT_decl_column(0x0a)
   16607                    
   16608                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16609                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2a0)
   16610                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
   16611                            .dwendtag $C$DW$T$44
   16612                    
   16613                    $C$DW$T$349     .dwtag  DW_TAG_typedef
   16614                            .dwattr $C$DW$T$349, DW_AT_name("SlWlanLinkQualityAsyncEvent_t")
   16615                            .dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$44)
   16616                            .dwattr $C$DW$T$349, DW_AT_language(DW_LANG_C)
   16617                            .dwattr $C$DW$T$349, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16618                            .dwattr $C$DW$T$349, DW_AT_decl_line(0x2a4)
   16619                            .dwattr $C$DW$T$349, DW_AT_decl_column(0x02)
   16620                    
   16621                    
   16622                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
   16623                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x50)
   16624                    $C$DW$1055      .dwtag  DW_TAG_member
   16625                            .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$13)
   16626                            .dwattr $C$DW$1055, DW_AT_name("Id")
   16627                            .dwattr $C$DW$1055, DW_AT_TI_symbol_name("Id")
   16628                            .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  347

   16629                            .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   16630                            .dwattr $C$DW$1055, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16631                            .dwattr $C$DW$1055, DW_AT_decl_line(0x2bb)
   16632                            .dwattr $C$DW$1055, DW_AT_decl_column(0x19)
   16633                    
   16634                    $C$DW$1056      .dwtag  DW_TAG_member
   16635                            .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$45)
   16636                            .dwattr $C$DW$1056, DW_AT_name("Data")
   16637                            .dwattr $C$DW$1056, DW_AT_TI_symbol_name("Data")
   16638                            .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16639                            .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   16640                            .dwattr $C$DW$1056, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16641                            .dwattr $C$DW$1056, DW_AT_decl_line(0x2bc)
   16642                            .dwattr $C$DW$1056, DW_AT_decl_column(0x19)
   16643                    
   16644                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16645                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2ba)
   16646                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
   16647                            .dwendtag $C$DW$T$46
   16648                    
   16649                    $C$DW$T$598     .dwtag  DW_TAG_typedef
   16650                            .dwattr $C$DW$T$598, DW_AT_name("SlWlanEvent_t")
   16651                            .dwattr $C$DW$T$598, DW_AT_type(*$C$DW$T$46)
   16652                            .dwattr $C$DW$T$598, DW_AT_language(DW_LANG_C)
   16653                            .dwattr $C$DW$T$598, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16654                            .dwattr $C$DW$T$598, DW_AT_decl_line(0x2bd)
   16655                            .dwattr $C$DW$T$598, DW_AT_decl_column(0x03)
   16656                    
   16657                    $C$DW$T$599     .dwtag  DW_TAG_pointer_type
   16658                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$598)
   16659                            .dwattr $C$DW$T$599, DW_AT_address_class(0x20)
   16660                    
   16661                    
   16662                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
   16663                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
   16664                    $C$DW$1057      .dwtag  DW_TAG_member
   16665                            .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$13)
   16666                            .dwattr $C$DW$1057, DW_AT_name("Ip")
   16667                            .dwattr $C$DW$1057, DW_AT_TI_symbol_name("Ip")
   16668                            .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16669                            .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   16670                            .dwattr $C$DW$1057, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16671                            .dwattr $C$DW$1057, DW_AT_decl_line(0xd7)
   16672                            .dwattr $C$DW$1057, DW_AT_decl_column(0x0a)
   16673                    
   16674                    $C$DW$1058      .dwtag  DW_TAG_member
   16675                            .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$13)
   16676                            .dwattr $C$DW$1058, DW_AT_name("Gateway")
   16677                            .dwattr $C$DW$1058, DW_AT_TI_symbol_name("Gateway")
   16678                            .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16679                            .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   16680                            .dwattr $C$DW$1058, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16681                            .dwattr $C$DW$1058, DW_AT_decl_line(0xd8)
   16682                            .dwattr $C$DW$1058, DW_AT_decl_column(0x0a)
   16683                    
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  348

   16684                    $C$DW$1059      .dwtag  DW_TAG_member
   16685                            .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$13)
   16686                            .dwattr $C$DW$1059, DW_AT_name("Dns")
   16687                            .dwattr $C$DW$1059, DW_AT_TI_symbol_name("Dns")
   16688                            .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16689                            .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   16690                            .dwattr $C$DW$1059, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16691                            .dwattr $C$DW$1059, DW_AT_decl_line(0xd9)
   16692                            .dwattr $C$DW$1059, DW_AT_decl_column(0x0a)
   16693                    
   16694                            .dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16695                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xd6)
   16696                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
   16697                            .dwendtag $C$DW$T$47
   16698                    
   16699                    $C$DW$T$96      .dwtag  DW_TAG_typedef
   16700                            .dwattr $C$DW$T$96, DW_AT_name("SlIpV4AcquiredAsync_t")
   16701                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
   16702                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   16703                            .dwattr $C$DW$T$96, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16704                            .dwattr $C$DW$T$96, DW_AT_decl_line(0xda)
   16705                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x02)
   16706                    
   16707                    
   16708                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
   16709                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
   16710                    $C$DW$1060      .dwtag  DW_TAG_member
   16711                            .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$48)
   16712                            .dwattr $C$DW$1060, DW_AT_name("Ip")
   16713                            .dwattr $C$DW$1060, DW_AT_TI_symbol_name("Ip")
   16714                            .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16715                            .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   16716                            .dwattr $C$DW$1060, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16717                            .dwattr $C$DW$1060, DW_AT_decl_line(0xe4)
   16718                            .dwattr $C$DW$1060, DW_AT_decl_column(0x0a)
   16719                    
   16720                    $C$DW$1061      .dwtag  DW_TAG_member
   16721                            .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$48)
   16722                            .dwattr $C$DW$1061, DW_AT_name("Dns")
   16723                            .dwattr $C$DW$1061, DW_AT_TI_symbol_name("Dns")
   16724                            .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16725                            .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   16726                            .dwattr $C$DW$1061, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16727                            .dwattr $C$DW$1061, DW_AT_decl_line(0xe5)
   16728                            .dwattr $C$DW$1061, DW_AT_decl_column(0x0a)
   16729                    
   16730                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16731                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xe3)
   16732                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
   16733                            .dwendtag $C$DW$T$49
   16734                    
   16735                    $C$DW$T$97      .dwtag  DW_TAG_typedef
   16736                            .dwattr $C$DW$T$97, DW_AT_name("SlIpV6AcquiredAsync_t")
   16737                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$49)
   16738                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  349

   16739                            .dwattr $C$DW$T$97, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16740                            .dwattr $C$DW$T$97, DW_AT_decl_line(0xe6)
   16741                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x02)
   16742                    
   16743                    
   16744                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
   16745                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
   16746                    $C$DW$1062      .dwtag  DW_TAG_member
   16747                            .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$13)
   16748                            .dwattr $C$DW$1062, DW_AT_name("IpAddress")
   16749                            .dwattr $C$DW$1062, DW_AT_TI_symbol_name("IpAddress")
   16750                            .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16751                            .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   16752                            .dwattr $C$DW$1062, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16753                            .dwattr $C$DW$1062, DW_AT_decl_line(0xea)
   16754                            .dwattr $C$DW$1062, DW_AT_decl_column(0x0d)
   16755                    
   16756                    $C$DW$1063      .dwtag  DW_TAG_member
   16757                            .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$13)
   16758                            .dwattr $C$DW$1063, DW_AT_name("LeaseTime")
   16759                            .dwattr $C$DW$1063, DW_AT_TI_symbol_name("LeaseTime")
   16760                            .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16761                            .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   16762                            .dwattr $C$DW$1063, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16763                            .dwattr $C$DW$1063, DW_AT_decl_line(0xeb)
   16764                            .dwattr $C$DW$1063, DW_AT_decl_column(0x0d)
   16765                    
   16766                    $C$DW$1064      .dwtag  DW_TAG_member
   16767                            .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$30)
   16768                            .dwattr $C$DW$1064, DW_AT_name("Mac")
   16769                            .dwattr $C$DW$1064, DW_AT_TI_symbol_name("Mac")
   16770                            .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16771                            .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   16772                            .dwattr $C$DW$1064, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16773                            .dwattr $C$DW$1064, DW_AT_decl_line(0xec)
   16774                            .dwattr $C$DW$1064, DW_AT_decl_column(0x0d)
   16775                    
   16776                    $C$DW$1065      .dwtag  DW_TAG_member
   16777                            .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$9)
   16778                            .dwattr $C$DW$1065, DW_AT_name("Padding")
   16779                            .dwattr $C$DW$1065, DW_AT_TI_symbol_name("Padding")
   16780                            .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16781                            .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   16782                            .dwattr $C$DW$1065, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16783                            .dwattr $C$DW$1065, DW_AT_decl_line(0xed)
   16784                            .dwattr $C$DW$1065, DW_AT_decl_column(0x0d)
   16785                    
   16786                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16787                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe9)
   16788                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
   16789                            .dwendtag $C$DW$T$50
   16790                    
   16791                    $C$DW$T$351     .dwtag  DW_TAG_typedef
   16792                            .dwattr $C$DW$T$351, DW_AT_name("SlIpLeasedAsync_t")
   16793                            .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$50)
TI ARM Assembler Unix v20.2.5 Sun Mar 27 17:11:53 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  350

   16794                            .dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
   16795                            .dwattr $C$DW$T$351, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/
   16796                            .dwattr $C$DW$T$351, DW_AT_decl_line(0xee)
   16797                            .dwattr $C$DW$T$351, DW_AT_decl_column(0x02)
   16798                    
   16799                    
   16800                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
   16801                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x0c)
   16802                    $C$DW$1066      .dwtag  DW_TAG_member
   16803                            .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$13)
   16804                            .dwattr $C$DW$1066, DW_AT_name("IpAddress")
   16805                            .dwattr $C$DW$1066, DW_AT_TI_symbol_name("IpAddress")
   16806                            .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16807                            .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   16808                            .dwattr $C$DW$1066, DW_AT_decl_file("/vagrant/2022_Q1_14_2_22/sdk_root/source/ti/drivers/net/w
   16809                            .dwattr $C$DW$1066, DW_AT_decl_line(0xf2)
   16810                            .dwattr $C$DW$1066, DW_AT_decl_column(0x0d)
   16811                    
   16812                    $C$DW$1067      .dwtag  DW_TAG_member
   16813                            .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$30)
   16814                            .dwattr $C$DW$1067, DW_AT_name("Mac")
   16815                            .dwattr $C$DW$1067, DW_AT_TI_symbol_name("Mac")
   16816                            .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
